Revit 2024 API
BuiltInFailures.RoomFailures.RoomTooShort Property
 [Room] is very short. If this is not intended, change its Upper Limit and Offset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomTooShort { get; }
Visual Basic
Public Shared ReadOnly Property RoomTooShort As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomTooShort {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace